In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('train.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Replacing Null values

In [4]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
df=df.drop(['Name','Cabin','Ticket'],axis=1)

In [6]:
df.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    male  22.0      1      0   7.2500        S
1            2         1       1  female  38.0      1      0  71.2833        C
2            3         1       3  female  26.0      0      0   7.9250        S
3            4         1       1  female  35.0      1      0  53.1000        S
4            5         0       3    male  35.0      0      0   8.0500        S

In [7]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Embarked         2
dtype: int64

In [8]:
df['Age']=df['Age'].fillna(df['Age'].mean())

In [9]:
df['Embarked']=df['Embarked'].fillna(value='D')

In [10]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       0
dtype: int64

In [11]:
df.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    male  22.0      1      0   7.2500        S
1            2         1       1  female  38.0      1      0  71.2833        C
2            3         1       3  female  26.0      0      0   7.9250        S
3            4         1       1  female  35.0      1      0  53.1000        S
4            5         0       3    male  35.0      0      0   8.0500        S

## PassengerID

In [12]:
passengerID=df.iloc[:,0]

In [13]:
passengerID

0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: PassengerId, Length: 891, dtype: int64

In [14]:
df=df.drop('PassengerId',axis=1)

In [15]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

## Targets

In [16]:
targets=df.iloc[:,0]

In [17]:
df=df.drop('Survived',axis=1)

In [18]:
df.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  22.0      1      0   7.2500        S
1       1  female  38.0      1      0  71.2833        C
2       3  female  26.0      0      0   7.9250        S
3       1  female  35.0      1      0  53.1000        S
4       3    male  35.0      0      0   8.0500        S

## Pclass

In [19]:
Pclass_dummies=pd.get_dummies(df['Pclass'])

In [20]:
Pclass_dummies=Pclass_dummies.rename(columns={1:'Pclass1',2:'Pclass2',3:'Pclass3'})

In [21]:
df=df.drop('Pclass',axis=1)
df=pd.concat([df,Pclass_dummies],axis=1)
df.head()

      Sex   Age  SibSp  Parch     Fare Embarked  Pclass1  Pclass2  Pclass3
0    male  22.0      1      0   7.2500        S        0        0        1
1  female  38.0      1      0  71.2833        C        1        0        0
2  female  26.0      0      0   7.9250        S        0        0        1
3  female  35.0      1      0  53.1000        S        1        0        0
4    male  35.0      0      0   8.0500        S        0        0        1

## Sex

In [22]:
df['Sex']=df['Sex'].map({'male':1,'female':0})
df.head()

   Sex   Age  SibSp  Parch     Fare Embarked  Pclass1  Pclass2  Pclass3
0    1  22.0      1      0   7.2500        S        0        0        1
1    0  38.0      1      0  71.2833        C        1        0        0
2    0  26.0      0      0   7.9250        S        0        0        1
3    0  35.0      1      0  53.1000        S        1        0        0
4    1  35.0      0      0   8.0500        S        0        0        1

## Age

In [23]:
df['Age'].mean()

29.699117647058763

In [24]:
df['Age'].median()

29.69911764705882

## SibSp & Parch = Relatives

In [25]:
#df['SibSp'].value_counts()

In [26]:
#df['SibSp'].mean()

In [27]:
#df['SibSp'].median()

In [28]:
#df['Parch'].value_counts()

In [29]:
#sum=df.iloc[:,2:4]
#sum_columns=sum.sum(axis=1)
#sum_columns.value_counts()

In [30]:
#Relatives=pd.DataFrame()
#Relatives['Relatives']=sum_columns
#df=pd.concat([df,Relatives],axis=1)
#df=df.drop(['SibSp','Parch'],axis=1)
#df.head()

## Fare

In [31]:
df['Fare'].mean()

32.2042079685746

In [32]:
df['Fare'].median()

14.4542

## Embarked

In [33]:
df['Embarked'].unique()

array(['S', 'C', 'Q', 'D'], dtype=object)

In [34]:
embarked_dummies=pd.get_dummies(df['Embarked'])

In [35]:
embarked_dummies

     C  D  Q  S
0    0  0  0  1
1    1  0  0  0
2    0  0  0  1
3    0  0  0  1
4    0  0  0  1
..  .. .. .. ..
886  0  0  0  1
887  0  0  0  1
888  0  0  0  1
889  1  0  0  0
890  0  0  1  0

[891 rows x 4 columns]

In [36]:
df=pd.concat([df,embarked_dummies],axis=1)
df=df.drop('Embarked',axis=1)

In [37]:
inputs=df.copy()

## Scaling

In [38]:
from sklearn.base import BaseEstimator, TransformerMixin
from sklearn.preprocessing import StandardScaler

class CustomScaler(BaseEstimator,TransformerMixin): 
    
    def __init__(self,columns,copy=True,with_mean=True,with_std=True):
        self.scaler = StandardScaler(copy,with_mean,with_std)
        self.columns = columns
        self.mean_ = None
        self.var_ = None

    def fit(self, X, y=None):
        self.scaler.fit(X[self.columns], y)
        self.mean_ = np.mean(X[self.columns])
        self.var_ = np.var(X[self.columns])
        return self

    def transform(self, X, y=None, copy=None):
        init_col_order = X.columns
        X_scaled = pd.DataFrame(self.scaler.transform(X[self.columns]), columns=self.columns)
        X_not_scaled = X.loc[:,~X.columns.isin(self.columns)]
        return pd.concat([X_not_scaled, X_scaled], axis=1)[init_col_order]

In [39]:
columns_to_scale=(['Age','Fare','Parch','SibSp'])
titanic_scaler=CustomScaler(columns_to_scale)
titanic_scaler.fit(inputs)
scaled_inputs=titanic_scaler.transform(inputs)

##  Model

In [40]:
from sklearn.linear_model import LogisticRegression
logic=LogisticRegression()
logic.fit(scaled_inputs,targets)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [41]:
logic.score(scaled_inputs,targets)

0.8058361391694725

In [42]:
compare=pd.DataFrame()
compare['PassengerID']=passengerID
compare['Outputs']=logic.predict(scaled_inputs)
compare['Survived']=targets
compare

     PassengerID  Outputs  Survived
0              1        0         0
1              2        1         1
2              3        1         1
3              4        1         1
4              5        0         0
..           ...      ...       ...
886          887        0         0
887          888        1         1
888          889        0         0
889          890        1         1
890          891        0         0

[891 rows x 3 columns]

In [43]:
Summary=pd.DataFrame()
Summary['Features']=inputs.columns.values
Summary['Weights']=np.transpose(logic.coef_)
Summary['Odds_Ratio']=np.exp(Summary['Weights'])
Summary['Percentage']=Summary['Odds_Ratio']*100
Summary

   Features   Weights  Odds_Ratio  Percentage
0       Sex -2.599531    0.074308    7.430843
1       Age -0.486884    0.614538   61.453816
2     SibSp -0.342035    0.710324   71.032358
3     Parch -0.070531    0.931899   93.189892
4      Fare  0.131272    1.140278  114.027800
5   Pclass1  0.961943    2.616775  261.677538
6   Pclass2  0.109811    1.116068  111.606751
7   Pclass3 -1.071798    0.342392   34.239238
8         C  0.094683    1.099311  109.931072
9         D  0.192139    1.211839  121.183897
10        Q  0.060239    1.062090  106.209038
11        S -0.347105    0.706731   70.673102

## Save model and scaler file

In [44]:
import pickle
with open('model2','wb') as file:
    pickle.dump(logic,file)

In [45]:
with open('scaler2','wb') as file:
    pickle.dump(titanic_scaler,file)